# TagOrientation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementTag..::..TagOrientation Property
SpatialElementTag Class See Also
---
The orientation of the tag.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public SpatialElementTagOrientation TagOrientation { get; set; }
```

Visual Basic
---
```text
Public Property TagOrientation As SpatialElementTagOrientation
	Get
	Set
```

Visual C++
---
```text
public:
property SpatialElementTagOrientation TagOrientation {
	SpatialElementTagOrientation get ();
	void set (SpatialElementTagOrientation value);
}
```

# Remarks
See [!:Autodesk::Revit::DB::getSpatialElementTagOrientation] for the supported orientations.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
SpatialElementTag Class
Autodesk.Revit.DB Namespace